import Mock from 'mockjs'


let data = Mock.mock({
    "list|500": [{
        //id
        "id|+1": 0,
        //图片
        "img":"@image(80x80,@color())",
        //房型
        "fangxing|1": ["一室", "二室", "三室", "四室", "五室", "六室", "七室", ],
        //价格
        "jiage|100-1000": 1,
        //区域
        "quyu|1": ['东城', '西城', '朝阳', '海淀', '丰台', '石景山', '通州', '昌平', '大兴', '亦庄开发区', '顺义', '房山', '门头沟', '平谷', '怀柔', '密云', '延庆'],
        //地铁
        "ditie|1": ['大兴机场', '1号线', '2号线', '4号线大兴线', '5号线', '6号线', '7号线', '8号线', '9号线', '10号线', '13号线', '14号线', '15号线', '16号线', '八通线', '亦庄线', '昌平线', '房山线', '机场线', 's1线', '西郊线'],
        //面积
        "mianji|40-300":1,
        //单价
        "danjia|10000-40000":1,
        //楼层
        "louceng|1":["高楼层","中楼层","低楼层"]
    }]
})


Mock.mock('/list',function(){
    return data.list
})